rottenpotatoes/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Lagaan"], ["director", "Ashutosh"], ["created_at", "2021-10-13 20:33:03.656744"], ["updated_at", "2021-10-13 20:33:03.656744"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def similar
    @movie = Movie.find_by(id: params[:id])

    # When the specified movie has no director:
    if @movie.director.nil? || @movie.director.empty?